
## Terraform plan for environment: `int`

**Commit:** 6cf20b8dfc1ebc9cc7385c0f4c2a694f5319a8ae


**API version:** 802463b33a
**CLI version:** 802463b33a
**Selfserve version:** 802463b33a
**Internal version:** 802463b33a

### Plan summary

`3 to add, 96 to change, 19 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
module.service.aws_cloudwatch_log_group.this["search"]
module.service.aws_lb_target_group.this["search"]
module.service.module.batch.aws_batch_job_definition.this["search"]
module.service.module.cloudwatch_log-metric-filter["search"].aws_cloudwatch_log_metric_filter.this[0]
module.service.module.ecs_cluster["search"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["search"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["search"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["search"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["search"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["search"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["search"].aws_ecs_service.this[0]
module.service.module.ecs_service["search"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["search"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["search"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["search"].aws_iam_role.tasks[0]
module.service.module.ecs_service["search"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["search"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["search"].module.container_definition["search"].aws_cloudwatch_log_group.this[0]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_caller_identity.current
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["api"].data.aws_partition.current
module.service.module.ecs_service["api"].data.aws_region.current
module.service.module.ecs_service["internal"].data.aws_caller_identity.current
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["internal"].data.aws_partition.current
module.service.module.ecs_service["internal"].data.aws_region.current
module.service.module.ecs_service["selfserve"].data.aws_caller_identity.current
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["selfserve"].data.aws_partition.current
module.service.module.ecs_service["selfserve"].data.aws_region.current
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
module.service.module.ecs_service["api"].module.container_definition["api"].data.aws_region.current
module.service.module.ecs_service["internal"].module.container_definition["internal"].data.aws_region.current
module.service.module.ecs_service["selfserve"].module.container_definition["selfserve"].data.aws_region.current
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.this
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["api"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.tasks[0]
module.service.module.ecs_service["api"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.tasks[0]
module.service.module.ecs_service["internal"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.tasks[0]
module.service.module.ecs_service["selfserve"].aws_iam_role_policy.tasks[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-transxchange-consumer"]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "2831834068253549200" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v6.1.6-rc1-rc1" -> "802463b33a"
          ~ "deployed_assets_version"      = "release-v6.1.6-rc1-rc1" -> "release-v6.0.2"
          ~ "deployed_cli_image_tag"       = "release-v6.1.6-rc1-rc1" -> "802463b33a"
          ~ "deployed_internal_image_tag"  = "release-v6.1.6-rc1-rc1" -> "802463b33a"
          ~ "deployed_selfserve_image_tag" = "release-v6.1.6-rc1-rc1" -> "802463b33a"
        }
    }

  # module.service.aws_cloudwatch_dashboard.this will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "this" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (1 unchanged element hidden)
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/events/vol-app-int-failures' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "Batch failure logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 18
                        x          = 12
                        y          = 6
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (44 unchanged elements hidden)
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-int-liquibase",
                                ],
                              - [
                                  - "AWS/Logs",
                                  - "IncomingLogEvents",
                                  - "LogGroupName",
                                  - "/aws/batch/vol-app-int-search",
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-ch-vs-olcs-diffs' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "ch-vs-olcs-diffs-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (43 unchanged elements hidden)
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-liquibase' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "liquibase-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                  - {
                      - height     = 1
                      - properties = {
                          - query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-search' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "search-logs"
                          - view    = "table"
                        }
                      - type       = "log"
                      - width      = 6
                      - x          = 0
                      - y          = 0
                    },
                ]
            }
        )
        id             = "batch-vol-app-int"
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this["search"] will be destroyed
  # (because key ["search"] is not in for_each map)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:eu-west-1:054614622558:log-group:/aws/batch/vol-app-int-search" -> null
      - id                = "/aws/batch/vol-app-int-search" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/batch/vol-app-int-search" -> null
      - retention_in_days = 1 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "int"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_lb_target_group.this["search"] will be destroyed
  # (because key ["search"] is not in for_each map)
  - resource "aws_lb_target_group" "this" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-int-search-tg/4b4fedc6664f75e9" -> null
      - arn_suffix                         = "targetgroup/vol-app-int-search-tg/4b4fedc6664f75e9" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-int-search-tg/4b4fedc6664f75e9" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "vol-app-int-search-tg" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Environment" = "int"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-ee79348b" -> null
        # (1 unchanged attribute hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 300 -> null
          - matcher             = "200-499" -> null
          - path                = "/healthcheck" -> null
          - port                = "8080" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 60 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:264"
        name                       = "vol-app-int-cancel-unsubmitted-bilateral"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:264"
        name                       = "vol-app-int-ch-vs-olcs-diffs"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:264"
        name                       = "vol-app-int-clean-up-variations"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:264"
        name                       = "vol-app-int-close-expired-windows"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:264"
        name                       = "vol-app-int-cns"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:264"
        name                       = "vol-app-int-company-profile-dlq"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:264"
        name                       = "vol-app-int-create-psv-licence-surrender-task"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:264"
        name                       = "vol-app-int-data-retention-delete"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:264"
        name                       = "vol-app-int-data-retention-populate"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:264"
        name                       = "vol-app-int-data-retention-postcheck"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:264"
        name                       = "vol-app-int-data-retention-precheck"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:264"
        name                       = "vol-app-int-database-maintenance"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:264"
        name                       = "vol-app-int-digital-continuation-reminders"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:264"
        name                       = "vol-app-int-duplicate-vehicle-warning"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:264"
        name                       = "vol-app-int-enqueue-ch-compare"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:264"
        name                       = "vol-app-int-expire-bus-registration"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:264"
        name                       = "vol-app-int-flag-urgent-tasks"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:264"
        name                       = "vol-app-int-import-users-from-csv"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:264"
        name                       = "vol-app-int-inspection-request-email"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:264"
        name                       = "vol-app-int-interim-end-date-enforcement"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:264"
        name                       = "vol-app-int-international-goods-export"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:264"
        name                       = "vol-app-int-last-tm-letter"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:264"
        name                       = "vol-app-int-licence-status-rules"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:264"
        name                       = "vol-app-int-mark-expired-permits"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:264"
        name                       = "vol-app-int-process-cl"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:264"
        name                       = "vol-app-int-process-company-profile"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:264"
        name                       = "vol-app-int-process-inbox"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:264"
        name                       = "vol-app-int-process-insolvency"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:264"
        name                       = "vol-app-int-process-insolvency-dlq"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-ntu:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-ntu:264"
        name                       = "vol-app-int-process-ntu"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-community-licences:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-community-licences:264"
        name                       = "vol-app-int-process-queue-community-licences"
      ~ revision                   = 264 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-generation:264" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "802463b33a"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-w... (truncated, see full plan in the workflow run logs)
```

</details>